zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_aon_pmctl.h
// Field: [15:11] MAX_PER_M
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RECHARGECFG_MAX_PER_M_W                                    5
#define AON_PMCTL_RECHARGECFG_MAX_PER_M_M                           0x0000F800
#define AON_PMCTL_RECHARGECFG_MAX_PER_M_S                                   11

// Field:  [10:8] MAX_PER_E
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RECHARGECFG_MAX_PER_E_W                                    3
#define AON_PMCTL_RECHARGECFG_MAX_PER_E_M                           0x00000700
#define AON_PMCTL_RECHARGECFG_MAX_PER_E_S                                    8

// Field:   [7:3] PER_M
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RECHARGECFG_PER_M_W                                        5
#define AON_PMCTL_RECHARGECFG_PER_M_M                               0x000000F8
#define AON_PMCTL_RECHARGECFG_PER_M_S                                        3

// Field:   [2:0] PER_E
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RECHARGECFG_PER_E_W                                        3
#define AON_PMCTL_RECHARGECFG_PER_E_M                               0x00000007
#define AON_PMCTL_RECHARGECFG_PER_E_S                                        0

//*****************************************************************************
//
// Register: AON_PMCTL_O_RECHARGESTAT
//
//*****************************************************************************
// Field: [19:16] VDDR_SMPLS
//
// The last 4 VDDR samples.
//
// For each bit:
// 0: VDDR was below VDDR_OK threshold when recharge started
// 1: VDDR was above VDDR_OK threshold when recharge started
//
// The register is updated prior to every recharge period with a shift left,
// and bit 0 is updated with the last VDDR sample.
#define AON_PMCTL_RECHARGESTAT_VDDR_SMPLS_W                                  4
#define AON_PMCTL_RECHARGESTAT_VDDR_SMPLS_M                         0x000F0000
#define AON_PMCTL_RECHARGESTAT_VDDR_SMPLS_S                                 16

// Field:  [15:0] MAX_USED_PER
//
// Shows the maximum number of 32kHz periods that have separated two recharge
// cycles and VDDR still was above VDDR_OK threshold when the latter recharge
// started. This register can be used as an indication of the leakage current
// during standby.
//
// This bitfield is cleared to 0 when writing this register.
#define AON_PMCTL_RECHARGESTAT_MAX_USED_PER_W                               16
#define AON_PMCTL_RECHARGESTAT_MAX_USED_PER_M                       0x0000FFFF
#define AON_PMCTL_RECHARGESTAT_MAX_USED_PER_S                                0

//*****************************************************************************
//
// Register: AON_PMCTL_O_OSCCFG
//
//*****************************************************************************
// Field:   [7:3] PER_M
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_OSCCFG_PER_M_W                                             5
#define AON_PMCTL_OSCCFG_PER_M_M                                    0x000000F8
#define AON_PMCTL_OSCCFG_PER_M_S                                             3

// Field:   [2:0] PER_E
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_OSCCFG_PER_E_W                                             3
#define AON_PMCTL_OSCCFG_PER_E_M                                    0x00000007
#define AON_PMCTL_OSCCFG_PER_E_S                                             0

//*****************************************************************************
//
// Register: AON_PMCTL_O_RESETCTL
//
//*****************************************************************************
// Field:    [31] SYSRESET
//
// Cold reset register. Writing 1 to this bitfield will reset the entire chip
// and cause boot code to run again.
//
// 0: No effect
// 1: Generate system reset. Appears as SYSRESET in RESET_SRC
#define AON_PMCTL_RESETCTL_SYSRESET                                 0x80000000
#define AON_PMCTL_RESETCTL_SYSRESET_BITN                                    31
#define AON_PMCTL_RESETCTL_SYSRESET_M                               0x80000000
#define AON_PMCTL_RESETCTL_SYSRESET_S                                       31

// Field:    [25] BOOT_DET_1_CLR
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RESETCTL_BOOT_DET_1_CLR                           0x02000000
#define AON_PMCTL_RESETCTL_BOOT_DET_1_CLR_BITN                              25
#define AON_PMCTL_RESETCTL_BOOT_DET_1_CLR_M                         0x02000000
#define AON_PMCTL_RESETCTL_BOOT_DET_1_CLR_S                                 25

// Field:    [24] BOOT_DET_0_CLR
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RESETCTL_BOOT_DET_0_CLR                           0x01000000
#define AON_PMCTL_RESETCTL_BOOT_DET_0_CLR_BITN                              24
#define AON_PMCTL_RESETCTL_BOOT_DET_0_CLR_M                         0x01000000
#define AON_PMCTL_RESETCTL_BOOT_DET_0_CLR_S                                 24

// Field:    [17] BOOT_DET_1_SET
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RESETCTL_BOOT_DET_1_SET                           0x00020000
#define AON_PMCTL_RESETCTL_BOOT_DET_1_SET_BITN                              17
#define AON_PMCTL_RESETCTL_BOOT_DET_1_SET_M                         0x00020000
#define AON_PMCTL_RESETCTL_BOOT_DET_1_SET_S                                 17

// Field:    [16] BOOT_DET_0_SET
//
// Internal. Only to be used through TI provided API.
#define AON_PMCTL_RESETCTL_BOOT_DET_0_SET                           0x00010000
#define AON_PMCTL_RESETCTL_BOOT_DET_0_SET_BITN                              16
#define AON_PMCTL_RESETCTL_BOOT_DET_0_SET_M                         0x00010000
#define AON_PMCTL_RESETCTL_BOOT_DET_0_SET_S                                 16

// Field:    [15] WU_FROM_SD
//
// A Wakeup from SHUTDOWN on an IO event has occurred, or a wakeup from
// SHUTDOWN has occurred as a result of the debugger being attached.. (TCK pin
// being forced low)
//
// Please refer to IOC:IOCFGn.WU_CFG for configuring the IO's as wakeup
// sources.
//
// 0: Wakeup occurred from cold reset or brown out as seen in RESET_SRC
// 1: A wakeup has occurred from SHUTDOWN
//
// Note: This flag will be cleared when SLEEPCTL.IO_PAD_SLEEP_DIS is asserted.
#define AON_PMCTL_RESETCTL_WU_FROM_SD                               0x00008000
#define AON_PMCTL_RESETCTL_WU_FROM_SD_BITN                                  15
#define AON_PMCTL_RESETCTL_WU_FROM_SD_M                             0x00008000
#define AON_PMCTL_RESETCTL_WU_FROM_SD_S                                     15

